genestealer/everblu-meters-esp8266-improved/src/main.cpp
  uint32_t serial = 0;
  for (size_t i = 2; i < serial_end; i++)
  {
    serial = serial * 10 + (uint32_t)(code[i] - '0');
  }

  if (serial == 0 || serial > 0xFFFFFFUL)
  {
    return false;
  }

  if (out_year != nullptr)
  {
    *out_year = year;
  }
  if (out_serial != nullptr)
  {
    *out_serial = serial;
  }
  return true;
}

static const char *buildMqttClientIdWithSerial()
{
  static char client_id[64] = {};
  uint8_t year = 0;
  uint32_t serial = 0;
  if (parseMeterCodeParts(METER_CODE, &year, &serial))
  {
    snprintf(client_id, sizeof(client_id), "%s-%lu", SECRET_MQTT_CLIENT_ID, (unsigned long)serial);
  }
  else
  {
    // Keep startup resilient so validation can print a clear error afterward.
    snprintf(client_id, sizeof(client_id), "%s-%s", SECRET_MQTT_CLIENT_ID, METER_CODE);
  }
  return client_id;
}

const char *MQTT_CLIENT_ID_WITH_SERIAL = buildMqttClientIdWithSerial();

EspMQTTClient mqtt(
    SECRET_WIFI_SSID,           // Your Wifi SSID
    SECRET_WIFI_PASSWORD,       // Your WiFi key
    SECRET_MQTT_SERVER,         // MQTT Broker server ip
    SECRET_MQTT_USERNAME,       // MQTT Username Can be omitted if not needed
    SECRET_MQTT_PASSWORD,       // MQTT Password Can be omitted if not needed
    MQTT_CLIENT_ID_WITH_SERIAL, // MQTT Client name: uniquely identifies device by appending meter serial
    1883                        // MQTT Broker server port
);

// Base MQTT topic prefix for all EverBlu Cyble entities
// Centralising this avoids repeating "everblu/cyble/" all over the code.
// mqttBaseTopic is initialized at global scope using compile-time string
// concatenation with METER_SERIAL (via TOSTRING) and is only printed in setup().

const char jsonTemplate[] = "{ "
                            "\"liters\": %d, "
                            "\"counter\" : %d, "
                            "\"battery\" : %d, "
                            "\"rssi\" : %d, "
                            "\"timestamp\" : \"%s\" }";

// Define the default maximum retries if missing from the private.h file
#ifndef MAX_RETRIES
#define MAX_RETRIES 10 // Default: 10 retry attempts before cooldown
#endif

int _retry = 0;
const int max_retries = MAX_RETRIES;          // Maximum number of retry attempts (configurable in private.h)
unsigned long lastFailedAttempt = 0;          // Timestamp of last failed attempt
const unsigned long RETRY_COOLDOWN = 3600000; // 1 hour cooldown in milliseconds

// Global variable to store the reading schedule (default from private.h)
const char *readingSchedule = DEFAULT_READING_SCHEDULE;

// Helper variables for generating serial-prefixed MQTT topics and entity IDs
// These must be initialized before EspMQTTClient is constructed (for LWT topic)
// Format: everblu/cyble/{METER_SERIAL} (or everblu/cyble if meter prefix is disabled)
// Compile-time check: Ensure METER_CODE is defined
#if !defined(METER_CODE)
#error "METER_CODE must be defined in private.h"
#endif

// Define meter prefix option if not defined in private.h (default to enabled)
#ifndef ENABLE_METER_PREFIX_IN_ENTITY_IDS
#define ENABLE_METER_PREFIX_IN_ENTITY_IDS 1
#endif

// Define Home Assistant MQTT discovery option if not defined in private.h (default to enabled)
#ifndef ENABLE_HA_DISCOVERY
#define ENABLE_HA_DISCOVERY 1
#endif

// Buffer size calculations for MQTT topics:
// - meterSerialStr: serial as decimal string (max 8 digits) + null = 16 bytes
// - mqttBaseTopic: "everblu/cyble/" (15) + serial (8) + null (1) = 64 bytes
// - mqttLwtTopic: mqttBaseTopic + "/status" (7) + null (1) = 80 bytes
// Parsed at runtime from METER_CODE by parseMeterCode() called at the start of setup()
static uint8_t g_meterYear = 0;
static uint32_t g_meterSerial = 0;
char meterSerialStr[16] = {}; // filled by parseMeterCode()
#if ENABLE_METER_PREFIX_IN_ENTITY_IDS
char mqttBaseTopic[64] = {}; // filled by parseMeterCode()
char mqttLwtTopic[80] = {};  // filled by parseMeterCode()
#else
char mqttBaseTopic[64] = "everblu/cyble";       // Base MQTT topic without meter serial
char mqttLwtTopic[80] = "everblu/cyble/status"; // LWT status topic without serial number
#endif

/**
 * Parse METER_CODE ("YYSSSSSSNNN") into g_meterYear, g_meterSerial, and
 * the MQTT topic buffers.  Called once at the very start of setup().
 */
static void parseMeterCode()
{
  if (!parseMeterCodeParts(METER_CODE, &g_meterYear, &g_meterSerial))
  {
    Serial.println("[ERROR] Invalid METER_CODE - expected 9..12 digits: YY + serial + optional 3-digit suffix");
    return;
  }

  snprintf(meterSerialStr, sizeof(meterSerialStr), "%lu", (unsigned long)g_meterSerial);
#if ENABLE_METER_PREFIX_IN_ENTITY_IDS
  snprintf(mqttBaseTopic, sizeof(mqttBaseTopic), "everblu/cyble/%lu", (unsigned long)g_meterSerial);
  snprintf(mqttLwtTopic, sizeof(mqttLwtTopic), "everblu/cyble/%lu/status", (unsigned long)g_meterSerial);
#endif
}

// Standard buffer size for constructing MQTT topic strings
// Calculation: mqttBaseTopic (max 63) + longest suffix "/wifi_signal_percentage" (24) + null (1) = 88 bytes
// Buffer size: 128 bytes provides 1.45x safety margin for topic construction
#define MQTT_TOPIC_BUFFER_SIZE 128

// ============================================================================
// Meter Type Configuration
// ============================================================================

// Define meter type if not defined in private.h (default to water)
#ifndef METER_TYPE
#define METER_TYPE "water"
#endif

// Meter-specific configuration based on METER_TYPE
// These variables control the Home Assistant device class, icon, and unit of measurement
const char *meterDeviceClass;
const char *meterIcon;
const char *meterUnit;
// Compile-time string equality helper to avoid runtime strcmp for meter type
constexpr bool strEq(const char *a, const char *b)
{
  return (*a == *b) && (*a == '\0' || strEq(a + 1, b + 1));
}
constexpr bool meterIsGas = strEq(METER_TYPE, "gas");

// Initialize meter configuration
static void initMeterTypeConfig()
{
  if (meterIsGas)
  {
    meterDeviceClass = "gas";
    meterIcon = "mdi:meter-gas";
    meterUnit = "m³";
    Serial.println("[STATUS] Meter type: GAS (readings in m³)");
  }
  else
  {
    meterDeviceClass = "water";
    meterIcon = "mdi:water";
    meterUnit = "L";
    Serial.println("[STATUS] Meter type: WATER (readings in L)");
  }
}

// ============================================================================
// Schedule Validation API
// ============================================================================

// Note: isValidReadingSchedule() is now in utils.h/cpp

/**
 * @brief Validate and correct reading schedule
 *
 * Checks if current reading schedule is valid. If invalid, falls back
 * to safe default ("Monday-Friday") and logs a warning.
 */
static void validateReadingSchedule()
{
  if (!isValidReadingSchedule(readingSchedule))
  {
    Serial.printf("[WARNING] Invalid reading schedule '%s'. Falling back to 'Monday-Friday'.\n", readingSchedule);
    readingSchedule = "Monday-Friday";
  }
}

/**
 * @brief Update cached schedule times based on a local (UTC+offset) time
 */
static void updateResolvedScheduleFromLocal(int hourLocal, int minuteLocal)
{
  int normalizedHour = constrain(hourLocal, 0, 23);
  int normalizedMinute = constrain(minuteLocal, 0, 59);

  g_readHourLocal = normalizedHour;
  g_readMinuteLocal = normalizedMinute;

