genestealer/everblu-meters-esp8266-improved/src/main.cpp
  // Validate METER_CODE parse results
  if (!parseMeterCodeParts(METER_CODE, &parsed_year, &parsed_serial))
  {
    Serial.println("[ERROR] Invalid METER_CODE in private.h");
    Serial.println("       Expected 9..12 digits without dashes/spaces");
    Serial.println("       Format: \"YYSSSSSSS\" or \"YYSSSSSSSNNN\" (suffix optional)");
    Serial.println("       Example: label '16-0039185-107' -> '160039185' or '160039185107'");
    valid = false;
  }
  else
  {
    g_meterYear = parsed_year;
    g_meterSerial = parsed_serial;
    Serial.printf("✓ METER_CODE: %s (year=%d, serial=%lu)\n",
                  METER_CODE, g_meterYear, (unsigned long)g_meterSerial);
  }

// Validate FREQUENCY if defined (should be 300-500 MHz for 433 MHz band)
#ifdef FREQUENCY
  if (FREQUENCY < 300.0 || FREQUENCY > 500.0)
  {
    Serial.printf("[ERROR] Invalid FREQUENCY=%.2f MHz (expected 300-500 MHz)\n", FREQUENCY);
    valid = false;
  }
  else
  {
    Serial.printf("✓ FREQUENCY: %.6f MHz\n", FREQUENCY);
  }
#else
  Serial.println("✓ FREQUENCY: Using default 433.82 MHz (RADIAN protocol)");
#endif

  // Validate reading time defaults (UTC)
  if (DEFAULT_READING_HOUR_UTC < 0 || DEFAULT_READING_HOUR_UTC > 23)
  {
    Serial.printf("[ERROR] Invalid DEFAULT_READING_HOUR_UTC=%d (expected 0-23)\n", DEFAULT_READING_HOUR_UTC);
    valid = false;
  }
  else if (DEFAULT_READING_MINUTE_UTC < 0 || DEFAULT_READING_MINUTE_UTC > 59)
  {
    Serial.printf("[ERROR] Invalid DEFAULT_READING_MINUTE_UTC=%d (expected 0-59)\n", DEFAULT_READING_MINUTE_UTC);
    valid = false;
  }
  else
  {
    Serial.printf("✓ Reading Time (UTC): %02d:%02d\n", DEFAULT_READING_HOUR_UTC, DEFAULT_READING_MINUTE_UTC);
  }

// Validate GDO0 pin (basic check - should be defined)
#ifdef GDO0
  Serial.printf("✓ GDO0 Pin: GPIO %d\n", GDO0);
#else
  Serial.println("[ERROR] GDO0 pin not defined in private.h");
  valid = false;
#endif

  // Validate reading schedule
  if (!isValidReadingSchedule(readingSchedule))
  {
    Serial.printf("[WARNING] Invalid reading schedule '%s'. Will fall back to 'Monday-Friday'.\n", readingSchedule);
    Serial.println("         Expected: 'Monday-Friday', 'Monday-Saturday', or 'Monday-Sunday'");
  }
  else
  {
    Serial.printf("✓ Reading Schedule: %s\n", readingSchedule);
  }

  Serial.println("================================\n");

  return valid;
}

// Function: setup
// Description: Initializes the device, including serial communication, Wi-Fi, MQTT, and CC1101 radio with automatic calibration.
void setup()
{
  Serial.begin(115200);
  Serial.println("\n");
  // Give Serial a moment to initialize
  delay(100);

  // Parse METER_CODE into g_meterYear, g_meterSerial, and topic buffers
  // Must happen before any code uses these values
  parseMeterCode();

// On platforms with native USB Serial (e.g. some ESP32 cores) wait briefly for host to open the port
#if defined(ESP32)
  unsigned long __serial_wait_start = millis();
  while (!Serial && millis() - __serial_wait_start < 1000)
  {
    delay(10);
  }
#endif
  Serial.println("Everblu Meters ESP8266/ESP32 Starting...");
  Serial.println("Water/Gas usage data for Home Assistant");
  Serial.println("https://github.com/genestealer/everblu-meters-esp8266-improved");
  Serial.printf("[STATUS] Firmware version: %s\n", EVERBLU_FW_VERSION);
  Serial.printf("[STATUS] Target meter: 20%02d-%07lu\n\n", g_meterYear, (unsigned long)g_meterSerial);

  // Initialize meter type configuration
  initMeterTypeConfig();

  // Validate configuration before proceeding
  if (!validateConfiguration())
  {
    Serial.println("\n*** FATAL: Configuration validation failed! ***");
    Serial.println("*** Fix the errors in private.h and reflash ***");
    Serial.println("*** Device halted - will not continue ***\n");
    while (1)
    {
      digitalWrite(LED_BUILTIN, LOW); // Blink LED to indicate error
      delay(200);
      digitalWrite(LED_BUILTIN, HIGH);
      delay(200);
    }
  }

  // Initialize resolved schedule caches using UTC defaults and configured timezone offset
  updateResolvedScheduleFromUtc(DEFAULT_READING_HOUR_UTC, DEFAULT_READING_MINUTE_UTC);

  Serial.println("✓ Configuration valid - proceeding with initialization\n");

  // Note: mqttBaseTopic and meterSerialStr are initialized at global scope
  // to ensure they're ready when EspMQTTClient constructor runs
  Serial.printf("[MQTT] Base topic: %s\n", mqttBaseTopic);
  Serial.printf("[MQTT] Meter serial string: %s\n", meterSerialStr);
  Serial.printf("[MQTT] mqttBaseTopic length: %d\n", strlen(mqttBaseTopic));

  pinMode(LED_BUILTIN, OUTPUT);
  digitalWrite(LED_BUILTIN, LOW); // turned on to start with

  // Initialize persistent storage
#if defined(ESP8266)
  EEPROM.begin(EEPROM_SIZE);
  Serial.println("[STORAGE] EEPROM initialized");

  // Clear EEPROM if requested (set CLEAR_EEPROM_ON_BOOT=1 in private.h)
  // Use this when replacing ESP board, CC1101 module, or moving to a different meter
#if CLEAR_EEPROM_ON_BOOT
  Serial.println("[STORAGE] CLEARING EEPROM (CLEAR_EEPROM_ON_BOOT = 1)...");
  for (int i = 0; i < EEPROM_SIZE; i++)
  {
    EEPROM.write(i, 0xFF);
  }
  EEPROM.commit();
  Serial.println("[STORAGE] EEPROM cleared. Remember to set CLEAR_EEPROM_ON_BOOT = 0 after testing!");
#endif
#endif

  // Load stored frequency offset
  storedFrequencyOffset = loadFrequencyOffset();

  const bool noStoredOffset = (storedFrequencyOffset == 0.0f);

  // If no valid frequency offset found and auto-scan is enabled, perform wide initial scan
  if (noStoredOffset && autoScanEnabled)
  {
    Serial.println("[FREQ] No stored frequency offset found. Performing wide initial scan...");
    performWideInitialScan();
    // Reload the frequency offset after scan
    storedFrequencyOffset = loadFrequencyOffset();
  }
  else if (noStoredOffset)
  {
    Serial.println("[FREQ] AUTO_SCAN_ENABLED=0; skipping automatic frequency scan (offset remains 0.0 MHz).");
  }

  // Increase the max packet size to handle large MQTT payloads
  mqtt.setMaxPacketSize(2048); // Set to a size larger than your longest payload

  // Set the Last Will and Testament (LWT) with serial-specific topic
  // Note: mqttLwtTopic is initialized at global scope to ensure it's ready before MQTT client connects
  mqtt.enableLastWillMessage(mqttLwtTopic, "offline", true); // You can activate the retain flag by setting the third parameter to true

  // Make reconnection attempts faster and deterministic
  mqtt.setWifiReconnectionAttemptDelay(15000); // try every 15s
  mqtt.setMqttReconnectionAttemptDelay(15000); // try every 15s
  // In rare cases where the board wedges during connection attempts, allow drastic reset
  mqtt.enableDrasticResetOnConnectionFailures();

// Conditionally enable Wi-Fi PHY mode 11G (ESP8266 only).
#if defined(ESP8266)
#if ENABLE_WIFI_PHY_MODE_11G
  WiFi.setPhyMode(WIFI_PHY_MODE_11G);
  Serial.println("Wi-Fi PHY mode set to 11G.");
#else
  Serial.println("[WIFI] Wi-Fi PHY mode 11G is disabled.");
#endif
#else
  Serial.println("[WIFI] Wi-Fi PHY mode setting not applicable on this platform.");
#endif

  // Validate and log the configured reading schedule
  Serial.printf("[SCHEDULE] Reading schedule (configured): %s\n", readingSchedule);
  validateReadingSchedule();
  Serial.printf("[SCHEDULE] Reading schedule (effective): %s\n", readingSchedule);

  // Log effective frequency and warn if default is used
  Serial.printf("[FREQ] Frequency (effective): %.6f MHz\n", (double)FREQUENCY);
#if FREQUENCY_DEFINED_DEFAULT
  Serial.println("[NOTE] FREQUENCY not set in private.h; using default 433.820000 MHz (RADIAN).");
#endif

  // Optional functionalities of EspMQTTClient
#if ENABLE_MQTT_DEBUGGING
  mqtt.enableDebuggingMessages(true); // Enable debugging messages sent to serial output
  Serial.println(">> MQTT debugging enabled");
#endif

  // Set CC1101 radio frequency with automatic calibration
  Serial.println("[FREQ] Initializing CC1101 radio...");
  float effectiveFrequency = FREQUENCY + storedFrequencyOffset;
  if (storedFrequencyOffset != 0.0)
  {
    Serial.printf("[FREQ] Applying stored frequency offset: %.6f MHz (effective: %.6f MHz)\n",
                  storedFrequencyOffset, effectiveFrequency);
  }
  if (!cc1101_init(effectiveFrequency))
  {
    Serial.println("[WARNING] CC1101 radio initialization failed!");
    Serial.println("Please check: 1) Wiring connections 2) 3.3V power supply 3) SPI pins");
    Serial.println("Continuing with WiFi/MQTT only - radio functionality will not be available");
    Serial.println("Device will remain accessible via WiFi/MQTT for diagnostics and configuration");
    cc1101RadioConnected = false;
  }
  else
  {
    Serial.println("[FREQ] CC1101 radio initialized successfully");
    cc1101RadioConnected = true;
    Serial.printf("[FREQ] Adaptive frequency threshold set to %d reads\n", ADAPT_THRESHOLD);
  }

