genestealer/everblu-meters-esp8266-improved/src/main.cpp
  /*
  // Use this piece of code to test
  struct tmeter_data meter_data;
  meter_data = get_meter_data();
  Serial.printf("\nVolume : %d\nBattery (in months) : %d\nCounter : %d\nTime start : %d\nTime end : %d\n\n", meter_data.volume, meter_data.battery_left, meter_data.reads_counter, meter_data.time_start, meter_data.time_end);
  while (42);
  */

  // Initialize connectivity watchdog timers
  g_bootMillis = millis();
  g_wifiAttemptStartMs = g_bootMillis;
  g_mqttAttemptStartMs = 0; // will start once Wi-Fi is up
  g_wifiOfflineSince = 0;
  g_mqttOfflineSince = 0;
  g_lastConnLogMs = 0;
  g_lastLedBlinkMs = millis();

  Serial.println("[NET] Waiting for Wi-Fi/MQTT... timeouts enabled (Wi-Fi 30s, MQTT 30s). Will retry automatically.");
}

// ============================================================================
// Main Loop
// ============================================================================

/**
 * @brief Main loop function
 *
 * Handles MQTT communication, OTA updates, state machine execution,
 * and periodic WiFi diagnostics publishing.
 */
void loop()
{
  mqtt.loop();
  ArduinoOTA.handle();
#if WIFI_SERIAL_MONITOR_ENABLED
  wifiSerialLoop();
#endif

  // Update diagnostics and Wi-Fi details every 5 minutes
  if (millis() - lastWifiUpdate > 300000)
  { // 5 minutes in ms
    publishWifiDetails();
    lastWifiUpdate = millis();
  }

  // ------------------------------
  // Connectivity watchdog & LED feedback
  // ------------------------------
  const bool wifiUp = mqtt.isWifiConnected();
  const bool mqttUp = mqtt.isMqttConnected();

  // WiFi serial server is started in onConnectionEstablished() when enabled

  // Log transitions to connected state (one-time per connect)
  if (wifiUp && !g_prevWifiUp)
  {
    Serial.printf("[Wi-Fi] Connected to '%s' (IP: %s, RSSI: %d dBm)\n",
                  WiFi.SSID().c_str(), WiFi.localIP().toString().c_str(), WiFi.RSSI());
  }
  if (mqttUp && !g_prevMqttUp)
  {
    Serial.printf("[MQTT] Connected to %s:%d as '%s'\n",
                  mqtt.getMqttServerIp(), (int)mqtt.getMqttServerPort(), mqtt.getMqttClientName());
  }
  g_prevWifiUp = wifiUp;
  g_prevMqttUp = mqttUp;

  // Blink LED while offline (Wi-Fi or MQTT down)
  if (!(wifiUp && mqttUp))
  {
    if (millis() - g_lastLedBlinkMs >= OFFLINE_LED_BLINK_MS)
    {
      g_ledState = !g_ledState;
      digitalWrite(LED_BUILTIN, g_ledState ? LOW : HIGH); // active-low on many boards
      g_lastLedBlinkMs = millis();
    }
  }

  // Wi-Fi timeout and retry hinting (EspMQTTClient already retries; we add logs/force retry after timeout)
  if (!wifiUp)
  {
    if (g_wifiOfflineSince == 0)
      g_wifiOfflineSince = millis();
    // Start (or continue) Wi-Fi attempt timer
    if (g_wifiAttemptStartMs == 0)
      g_wifiAttemptStartMs = millis();

    // Periodic status log every ~5s so it doesn't look hung
    if (g_lastConnLogMs == 0 || millis() - g_lastConnLogMs > 5000)
    {
      wl_status_t st = WiFi.status();
      Serial.printf("[Wi-Fi] Connecting to '%s'... (status=%d: %s)\n", SECRET_WIFI_SSID, (int)st, wifiStatusToString(st));
      g_lastConnLogMs = millis();
    }

    // If a single attempt seems to stall for too long, force a fresh begin
    if (millis() - g_wifiAttemptStartMs > WIFI_CONNECT_TIMEOUT_MS)
    {
      Serial.println("[Wi-Fi] Connection attempt timed out. Forcing reconnect...");
      // Try a clean reconnect without blocking
      WiFi.disconnect(true);
      delay(50);
      WiFi.mode(WIFI_STA);
      WiFi.begin(SECRET_WIFI_SSID, SECRET_WIFI_PASSWORD);
      g_wifiAttemptStartMs = millis();
    }

    // Safety reboot if offline too long (optional)
    if (OFFLINE_REBOOT_AFTER_MS > 0 && (millis() - g_wifiOfflineSince) > OFFLINE_REBOOT_AFTER_MS)
    {
      Serial.println("[Wi-Fi] Offline too long. Rebooting device to recover...");
      delay(200);
      ESP.restart();
    }
    // No further checks if Wi-Fi is down
    return;
  }
  else
  {
    // Wi-Fi is up
    g_wifiAttemptStartMs = 0;
    g_wifiOfflineSince = 0;
  }

  // MQTT timeout and status logging
  if (!mqttUp)
  {
    if (g_mqttOfflineSince == 0)
      g_mqttOfflineSince = millis();
    if (g_mqttAttemptStartMs == 0)
      g_mqttAttemptStartMs = millis();

    if (g_lastConnLogMs == 0 || millis() - g_lastConnLogMs > 5000)
    {
      Serial.printf("[MQTT] Connecting to %s:%d as '%s'...\n", mqtt.getMqttServerIp(), (int)mqtt.getMqttServerPort(), mqtt.getMqttClientName());
      g_lastConnLogMs = millis();
    }

    if (millis() - g_mqttAttemptStartMs > MQTT_CONNECT_TIMEOUT_MS)
    {
      Serial.println("[MQTT] Connection attempt seems slow. Will keep retrying in background.");
      // We don't force reconnect here because EspMQTTClient handles the schedule; just reset our timer for logging cadence
      g_mqttAttemptStartMs = millis();
    }

    if (OFFLINE_REBOOT_AFTER_MS > 0 && (millis() - g_mqttOfflineSince) > OFFLINE_REBOOT_AFTER_MS)
    {
      Serial.println("[MQTT] Offline too long. Rebooting device to recover...");
      delay(200);
      ESP.restart();
    }
    return;
  }
  else
  {
    // Both Wi-Fi and MQTT are up - ensure LED is steady off and reset timers
    if (!g_ledState)
    {
      digitalWrite(LED_BUILTIN, HIGH); // off
    }
    g_ledState = false;
    g_mqttAttemptStartMs = 0;
    g_mqttOfflineSince = 0;
    g_lastConnLogMs = 0;
  }
}
